fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Создана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Объект.Период = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Договоры.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьДоговорыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Сообщить("Не указан период.");
		Возврат;
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Период", Объект.Период);
	
	МассивДоговоров = Новый Массив;
	Для Каждого Стр Из Объект.Договоры Цикл
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Договор", Стр.Договор);
		МассивДоговоров.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	ПараметрыПроцедуры.Вставить("Договоры", МассивДоговоров);
	
	РезультатЗапуска = ЗапуститьЗаданиеНаСервере(ПараметрыПроцедуры, УникальныйИдентификатор);
	Если РезультатЗапуска.Статус = "Выполнено" Тогда
		ОбработатьРезультат(РезультатЗапуска, Неопределено);
	ИначеЕсли РезультатЗапуска.Статус = "Выполняется" Тогда
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			РезультатЗапуска,
			Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект),
			ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект));
	Иначе
		ОбработатьРезультат(РезультатЗапуска, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДоговорыНаСервере()
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект", Неопределено);
	Если ОбъектОбработки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектОбработки.ЗаполнитьДоговоры();
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьЗаданиеНаСервере(ПараметрыПроцедуры, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Массовое создание актов";
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	РезультатЗапуска = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Обработка.ВКМ_МассовоеСозданиеАктов.МодульОбъекта.ВыполнитьСозданиеНаСервере",
		ПараметрыПроцедуры);
	
	Возврат РезультатЗапуска;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		Сообщить(Результат.КраткоеПредставлениеОшибки);
		Сообщить(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	ОбновитьДоговорыПослеСозданияНаСервере();
	Элементы.Договоры.Обновить();
	
	Сообщить("Массовое создание актов завершено.");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоговорыПослеСозданияНаСервере()
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект", Неопределено);
	Если ОбъектОбработки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбъектОбработки.Период) Тогда
		Возврат;
	КонецЕсли;
	
	НачалоПериода = НачалоМесяца(ОбъектОбработки.Период);
	КонецПериода  = КонецМесяца(ОбъектОбработки.Период);
	
	Для Каждого Стр Из ОбъектОбработки.Договоры Цикл
		
		Если Не ЗначениеЗаполнено(Стр.Договор) Тогда
			Продолжить;
		КонецЕсли;
		
		Реализация = ОбъектОбработки.НайтиРеализациюЗаПериод(Стр.Договор, НачалоПериода, КонецПериода);
		Стр.Реализация = Реализация;
		Стр.Создана = ЗначениеЗаполнено(Реализация);
		
		Если Стр.Создана Тогда
			Стр.Комментарий = "Уже существует";
		Иначе
			Стр.Комментарий = "";
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");
	
КонецПроцедуры

#КонецОбласти
